lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.h
/*
 * Copyright 2017, 2020, 2023 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_OV7670_H_
#define _FSL_OV7670_H_

#include "fsl_common.h"
#include "fsl_sccb.h"
#include "fsl_camera_device.h"

/*
 * Change log:
 *
 *   1.0.2
 *     - Fixed dummy line setting bug.
 *     - Disable PCLK during BLANK.
 *
 *   1.0.1
 *     - Fixed MISRA-C 2012 issues.
 *
 *   1.0.0
 *     - Initial version
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Register definitions for the OV7670.*/

#define OV7670_GAIN_REG 0x00U           /*!< Gain lower 8 bits (rest in vref). */

#define OV7670_BLUE_REG 0x01U           /*!< blue gain. */

#define OV7670_RED_REG 0x02U            /*!< red gain. */

#define OV7670_VREF_REG 0x03U           /*!< Pieces of GAIN, VSTART, VSTOP. */

#define OV7670_COM1_REG          0x04U  /*!< Control 1. */
#define OV7670_COM1_CCIR656_MASK 0x40U  /*!< CCIR656 enable. */

#define OV7670_BAVE_REG 0x05U           /*!< U/B Average level. */

#define OV7670_GbAVE_REG 0x06U          /*!< Y/Gb Average level. */

#define OV7670_AECHH_REG 0x07U          /*!< AEC MS 5 bits. */

#define OV7670_RAVE_REG 0x08U           /*!< V/R Average level. */

#define OV7670_COM2_REG         0x09U   /*!< Control 2. */
#define OV7670_COM2_SSLEEP_MASK 0x10U   /*!< Soft sleep mode. */

#define OV7670_PID_REG 0x0AU            /*!< Product ID MSB register address. */
#define OV7670_PID_NUM 0x76U            /*!< Product ID. */

#define OV7670_VER_REG 0x0BU            /*!< Product ID LSB register address. */
#define OV7670_VER_NUM 0x73U            /*!< Product VERION. */

#define OV7670_COM3_REG          0x0CU  /*!< Control 3. */
#define OV7670_COM3_SWAP_MASK    0x40U  /*!< Byte swap. */
#define OV7670_COM3_SCALEEN_MASK 0x08U  /*!< Enable scaling. */
#define OV7670_COM3_DCWEN_MASK   0x04U  /*!< Enable downsamp/crop/window. */

#define OV7670_COM4_REG 0x0DU           /*!< Control 4. */

#define OV7670_COM5_REG 0x0EU           /*!< All "reserved". */

#define OV7670_COM6_REG 0x0FU           /*!< Control 6. */

#define OV7670_AECH_REG 0x10U           /*!< More bits of AEC value. */

#define OV7670_CLKRC_REG      0x11U     /*!< Clocl control. */
#define OV7670_CLK_EXT_MASK   0x40U     /*!< Use external clock directly. */
#define OV7670_CLK_SCALE_MASK 0x3FU     /*!< Mask for internal clock scale. */

#define OV7670_COM7_REG           0x12U /*!< Control 7. */
#define OV7670_COM7_RESET_MASK    0x80U /*!< Register reset. */
#define OV7670_COM7_FMT_MASK_MASK 0x38U
#define OV7670_COM7_FMT_VGA_MASK  0x00U
#define OV7670_COM7_FMT_CIF_MASK  0x20U     /*!< CIF format. */
#define OV7670_COM7_FMT_QVGA_MASK 0x10U     /*!< QVGA format. */
#define OV7670_COM7_FMT_QCIF_MASK 0x08U     /*!< QCIF format. */
#define OV7670_COM7_RGB_MASK      0x04U     /*!< bits 0 and 2 - RGB format. */
#define OV7670_COM7_YUV_MASK      0x00U     /*!< YUV. */
#define OV7670_COM7_BAYER_MASK    0x01U     /*!< Bayer format. */
#define OV7670_COM7_PBAYER_MASK   0x05U     /*!< "Processed bayer". */

#define OV7670_COM8_REG          0x13U      /*!< Control 8. */
#define OV7670_COM8_FASTAEC_MASK 0x80U      /*!< Enable fast AGC/AEC. */
#define OV7670_COM8_AECSTEP_MASK 0x40U      /*!< Unlimited AEC step size. */
#define OV7670_COM8_BFILT_MASK   0x20U      /*!< Band filter enable. */
#define OV7670_COM8_AGC_MASK     0x04U      /*!< Auto gain enable. */
#define OV7670_COM8_AWB_MASK     0x02U      /*!< White balance enable. */
#define OV7670_COM8_AEC_MASK     0x01U      /*!< Auto exposure enable. */

#define OV7670_COM9_REG 0x14U               /*!< Control 9  - gain ceiling. */

#define OV7670_COM10_REG           0x15U    /*!< Control 10. */
#define OV7670_COM10_HSYNC_MASK    0x40U    /*!< HSYNC instead of HREF. */
#define OV7670_COM10_PCLK_HB_MASK  0x20U    /*!< Suppress PCLK on horiz blank. */
#define OV7670_COM10_HREF_REV_MASK 0x08U    /*!< Reverse HREF. */
#define OV7670_COM10_VS_LEAD_MASK  0x04U    /*!< VSYNC on clock leading edge. */
#define OV7670_COM10_VS_NEG_MASK   0x02U    /*!< VSYNC negative. */
#define OV7670_COM10_HS_NEG_MASK   0x01U    /*!< HSYNC negative. */

#define OV7670_RSVD_REG 0x16U               /*!< reserved. */

#define OV7670_HSTART_REG 0x17U             /*!< Horiz start high bits. */

#define OV7670_HSTOP_REG 0x18U              /*!< Horiz stop high bits. */

#define OV7670_VSTART_REG 0x19U             /*!< Vert start high bits. */

#define OV7670_VSTOP_REG 0x1AU              /*!< Vert stop high bits. */

#define OV7670_PSHFT_REG 0x1BU              /*!< Pixel delay after HREF. */

#define OV7670_MIDH_REG 0x1CU               /*!< Manuf. ID high. */

#define OV7670_MIDL_REG 0x1DU               /*!< Manuf. ID low. */

#define OV7670_MVFP_REG         0x1EU       /*!< Mirror / vflip. */
#define OV7670_MVFP_MIRROR_MASK 0x20U       /*!< Mirror image. */
#define OV7670_MVFP_FLIP_MASK   0x10U       /*!< Vertical flip. */

#define OV7670_LAEC_REG 0x1FU               /*!< reserved. */

#define OV7670_ADCCTR0_REG            0x20U /*!< ADC control. */
#define OV7670_ADCCTR0_RANGE_ADJ_MASK 0x08U /*!< ADC range adjustment. */

#define OV7670_ADCCTR1_REG 0x21U            /*!< reserved. */

#define OV7670_ADCCTR2_REG 0x22U            /*!< reserved. */

#define OV7670_ADCCTR3_REG 0x23U            /*!< reserved. */

#define OV7670_AEW_REG 0x24U                /*!< AGC upper limit. */

#define OV7670_AEB_REG 0x25U                /*!< AGC lower limit. */

#define OV7670_VPT_REG 0x26U                /*!< AGC/AEC fast mode op region. */

#define OV7670_BBIAS_REG 0x27U              /*!< B channel signal output bias. */

#define OV7670_GbBIAS_REG 0x28U             /*!< Gb channel signal output bias. */

#define OV7670_RSVD1_REG 0x29U              /*!< reserved 1. */

#define OV7670_EXHCH_REG 0x2AU              /*!< dummy pixel insert MSB. */

#define OV7670_EXHCL_REG 0x2BU              /*!< dummy pixel insert LSB. */

#define OV7670_HSYST_REG 0x30U              /*!< HSYNC rising edge delay. */

