lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.h
#define OV7670_HSYEN_REG 0x31U              /*!< HSYNC falling edge delay. */

#define OV7670_HREF_REG 0x32U               /*!< HREF pieces. */

#define OV7670_CHLF_REG 0x33U               /*!< array current control. */

#define OV7670_ARBLM_REG 0x34U              /*!< array reference control. */

#define OV7670_RSVD2_REG 0x35U              /*!< reserved 2. */

#define OV7670_RSVD3_REG 0x36U              /*!< reserved 3. */

#define OV7670_ADC_REG 0x37U                /*!< ADC control. */

#define OV7670_ACOM_REG 0x38U               /*!< ADC and Analog common mode control. */

#define OV7670_OFON_REG 0x39U               /*!< ADC offset control. */

#define OV7670_TSLB_REG        0x3AU        /*!< lots of stuff. */
#define OV7670_TSLB_YLAST_MASK 0x04U        /*!< UYVY or VYUY - see com13. */

#define OV7670_COM11_REG         0x3BU      /*!< Control 11. */
#define OV7670_COM11_NIGHT_MASK  0x80U      /*!< NIght mode enable. */
#define OV7670_COM11_NMFR_MASK   0x60U      /*!< Two bit NM frame rate. */
#define OV7670_COM11_HZAUTO_MASK 0x10U      /*!< Auto detect 50/60 Hz. */
#define OV7670_COM11_50HZ_MASK   0x08U      /*!< Manual 50Hz select. */
#define OV7670_COM11_EXP_MASK    0x02U

#define OV7670_COM12_REG       0x3CU    /*!< Control 12. */
#define OV7670_COM12_HREF_MASK 0x80U    /*!< HREF always. */

#define OV7670_COM13_REG         0x3DU  /*!< Control 13. */
#define OV7670_COM13_GAMMA_MASK  0x80U  /*!< Gamma enable. */
#define OV7670_COM13_UVSAT_MASK  0x40U  /*!< UV saturation auto adjustment. */
#define OV7670_COM13_UVSWAP_MASK 0x01U  /*!< V before U - w/TSLB. */

#define OV7670_COM14_REG        0x3EU   /*!< Control 14. */
#define OV7670_COM14_DCWEN_MASK 0x10U   /*!< DCW/PCLK-scale enable. */

#define OV7670_EDGE_REG 0x3FU           /*!< Edge enhancement factor. */

#define OV7670_COM15_REG         0x40U  /*!< Control 15. */
#define OV7670_COM15_R10F0_MASK  0x00U  /*!< Data range 10 to F0. */
#define OV7670_COM15_R01FE_MASK  0x80U  /*!< 01 to FE. */
#define OV7670_COM15_R00FF_MASK  0xC0U  /*!<  00 to FF. */
#define OV7670_COM15_RGB565_MASK 0x10U  /*!< RGB565 output. */
#define OV7670_COM15_RGB555_MASK 0x30U  /*!< RGB555 output. */

#define OV7670_COM16_REG          0x41U /*!< Control 16. */
#define OV7670_COM16_AWBGAIN_MASK 0x08U /*!< AWB gain enable. */

#define OV7670_COM17_REG         0x42U  /*!< Control 17. */
#define OV7670_COM17_AECWIN_MASK 0xc0U  /*!< AEC window - must match COM4. */
#define OV7670_COM17_CBAR_MASK   0x08U  /*!< DSP Color bar. */

#define OV7670_AWBC1_REG 0x43U          /*!< AWB control 1. */

#define OV7670_AWBC2_REG 0x44U          /*!< AWB control 2. */

#define OV7670_AWBC3_REG 0x45U          /*!< AWB control 3. */

#define OV7670_AWBC4_REG 0x46U          /*!< AWB control 4. */

#define OV7670_AWBC5_REG 0x47U          /*!< AWB control 5. */

#define OV7670_AWBC6_REG 0x48U          /*!< AWB control 6. */

#define OV7670_MTX1_REG 0x4fU           /*!< Matrix Coefficient 1. */

#define OV7670_MTX2_REG 0x50U           /*!< Matrix Coefficient 2. */

#define OV7670_MTX3_REG 0x51U           /*!< Matrix Coefficient 3. */

#define OV7670_MTX4_REG 0x52U           /*!< Matrix Coefficient 4. */

#define OV7670_MTX5_REG 0x53U           /*!< Matrix Coefficient 5. */

#define OV7670_MTX6_REG 0x54U           /*!< Matrix Coefficient 6. */

#define OV7670_BRIGHT_REG 0x55U         /*!< Brightness. */

#define OV7670_CONTRAS_REG 0x56U        /*!< Contrast control. */

#define OV7670_CONTRAS_CENTER_REG 0x57U /*!< Contrast cetnter control. */

#define OV7670_MTXS_REG    0x58U        /*!< Matrix Coefficient Sign. */
#define OV7670_AWBC7_MASK  0x59U        /*!< AWB Control 7. */
#define OV7670_AWBC8_MASK  0x5AU        /*!< AWB Control 8. */
#define OV7670_AWBC9_MASK  0x5BU        /*!< AWB Control 9. */
#define OV7670_AWBC10_MASK 0x5CU        /*!< AWB Control 10. */
#define OV7670_AWBC11_MASK 0x5DU        /*!< AWB Control 11. */
#define OV7670_AWBC12_MASK 0x5EU        /*!< AWB Control 12. */

#define OV7670_MANU_REG 0x67U           /*!< Manual U value. */

#define OV7670_MANV_REG 0x68U           /*!< Manual V value. */

#define OV7670_GFIX_REG 0x69U           /*!< Fix gain control. */

#define OV7670_GGAIN_REG 0x6AU          /*!< G Channel AWB Gain. */

#define OV7670_DBLV_REG 0x6BU

#define OV7670_AWBCTR3_REG 0x6CU            /*!< AWB Control 3. */

#define OV7670_AWBCTR2_REG 0x6DU            /*!< AWB Control 2. */

#define OV7670_AWBCTR1_REG 0x6EU            /*!< AWB Control 1. */

#define OV7670_AWBCTR0_REG 0x6FU            /*!< AWB Control 0. */

#define OV7670_SCALING_XSC_REG 0x70U        /*!< horizontal scale factor. */

#define OV7670_SCALING_YSC_REG 0x71U        /*!< vertical scale factor. */

#define OV7670_SCALING_DCWCTR_REG 0x72U     /*!< DCW control. */

#define OV7670_SCALING_PCLK_DIV_REG 0x73U   /*!< clock divider control. */

#define OV7670_REG74_REG 0x74U              /*!< register 74. */

#define OV7670_REG76_REG          0x76U     /*!< OV's name. */
#define OV7670_REG76_BLKPCOR_MASK 0x80U     /*!< Black pixel correction enable. */
#define OV7670_REG76_WHTPCOR_MASK 0x40U     /*!< White pixel correction enable. */

#define OV7670_SLOP_REG 0x7AU               /*!< gamma curve highest segment slop. */

#define OV7670_GAM1_REG         0x7BU       /*!< gamma curve 1 segment slop. */
#define OV7670_GAM2_REG         0x7CU       /*!< gamma curve 2 segment slop. */
#define OV7670_GAM3_REG         0x7DU       /*!< gamma curve 3 segment slop. */
#define OV7670_GAM4_REG         0x7EU       /*!< gamma curve 4 segment slop. */
#define OV7670_GAM5_REG         0x7FU       /*!< gamma curve 5 segment slop. */
#define OV7670_GAM6_REG         0x80U       /*!< gamma curve 6 segment slop. */
#define OV7670_GAM7_REG         0x81U       /*!< gamma curve 7 segment slop. */
#define OV7670_GAM8_REG         0x82U       /*!< gamma curve 8 segment slop. */
#define OV7670_GAM9_REG         0x83U       /*!< gamma curve 9 segment slop. */
#define OV7670_GAM10_REG        0x84U       /*!< gamma curve 10 segment slop. */
#define OV7670_GAM11_REG        0x85U       /*!< gamma curve 11 segment slop. */
#define OV7670_GAM12_REG        0x86U       /*!< gamma curve 12 segment slop. */
#define OV7670_GAM13_REG        0x87U       /*!< gamma curve 13 segment slop. */
#define OV7670_GAM14_REG        0x88U       /*!< gamma curve 14 segment slop. */
#define OV7670_GAM15_REG        0x89U       /*!< gamma curve 15 segment slop. */
#define OV7670_RGB444_REG       0x8cU       /*!< RGB 444 control. */
#define OV7670_R444_ENABLE_MASK 0x02U       /*!< Turn on RGB444, overrides 5x5. */
#define OV7670_R444_RGBX_MASK   0x01U       /*!< Empty nibble at end. */

#define OV7670_DM_LNL_REG 0x92U             /*!< dummy line low 8 bits. */

#define OV7670_DM_LNH_REG 0x93U             /*!< dummy line high 8 bits. */

#define OV7670_BD50ST_REG 0x9dU             /*!< 50Hz banding filter value. */

#define OV7670_BD60ST_REG 0x9eU             /*!< 60Hz banding filter value. */

#define OV7670_HAECC1_REG 0x9fU             /*!< Hist AEC/AGC control 1. */

#define OV7670_HAECC2_REG 0xa0U             /*!< Hist AEC/AGC control 2. */

