lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.h
#define OV7670_SCALING_PCLK_DELAY_REG 0xa2U /*!< pixel clock delay. */

#define OV7670_BD50MAX_REG 0xa5U            /*!< 50hz banding step limit. */

#define OV7670_HAECC3_REG 0xa6U             /*!< Hist AEC/AGC control 3. */

#define OV7670_HAECC4_REG 0xa7U             /*!< Hist AEC/AGC control 4. */

#define OV7670_HAECC5_REG 0xa8U             /*!< Hist AEC/AGC control 5. */

#define OV7670_HAECC6_REG 0xa9U             /*!< Hist AEC/AGC control 6. */

#define OV7670_HAECC7_REG 0xaaU             /*!< Hist AEC/AGC control 7. */

#define OV7670_BD60MAX_REG 0xabU            /*!< 60hz banding step limit. */

#define OV7670_STR_OPT_REG 0xacU            /*!< strobe control. */

#define OV7670_STR_R_REG 0xadU              /*!< R gain for LED output frame. */

#define OV7670_STR_G_REG 0xaeU              /*!< G gain for LED output frame. */

#define OV7670_STR_B_REG 0xafU              /*!< B gain for LED output frame. */

#define OV7670_ABLC1_REG 0xb1U              /*!< ABLC function control. */

#define OV7670_THL_ST_REG 0xb3U             /*!< ABLC target. */

/*! @} */

/*! @brief Configuration of window by setting the starting point configuration structure */
typedef struct ov7670_window_startPoint
{
    uint16_t hstartCoordinate;
    uint16_t vstartCoordinate;
} ov7670_window_start_point_t;

/*! end of ov7670 handler configuration structure                             */

/*! @brief Output format configuration structure                              */
typedef struct ov7670_output_format_config
{
    uint8_t com7;
    uint8_t com15;
    uint8_t rgb444;
} ov7670_output_format_config_t;
/*! end of Output format configuration structure                              */

/*! @brief Resolution configuration structure                                 */
typedef struct ov7670_resolution_config
{
    uint8_t com7;
    uint8_t com3;
    uint8_t com14;
    uint8_t scalingXsc;
    uint8_t scalingYsc;
    uint8_t scalingDcwctr;
    uint8_t scalingPclkDiv;
    uint8_t scalingPclkDelay;
} ov7670_resolution_config_t;
/*! end of Output format configuration structure                              */

/*! @brief Frame rate configuration data structure                            */
typedef struct ov7670_frame_rate_config
{
    uint8_t clkrc;
    uint8_t dblv;
    uint8_t exhch;
    uint8_t exhcl;
    uint8_t dm_lnl;
    uint8_t dm_lnh;
} ov7670_frame_rate_config_t;
/*! end of Frame rate configuration data structure                            */

/*! @brief Night mode configuration data structure                            */
typedef struct ov7670_night_mode_config
{
    uint8_t com11;
} ov7670_night_mode_config_t;
/*! end of night mode configuration data structure                            */

/*! @brief Banding filter selection data structure                            */
typedef struct ov7670_filter_config
{
    uint8_t com8;
    uint8_t bd50st;
    uint8_t bd60st;
    uint8_t bd50max;
    uint8_t bd60max;
    uint8_t com11;
} ov7670_filter_config_t;
/*! end of Banding filter selection data structure                            */

/*! @brief White balance configuration structure                              */
typedef struct ov7670_white_balance_config
{
    uint8_t com8;
    uint8_t awbctr0;
    uint8_t awbctr1;
    uint8_t awbctr2;
    uint8_t awbctr3;
    uint8_t awbc1;
    uint8_t awbc2;
    uint8_t awbc3;
    uint8_t awbc4;
    uint8_t awbc5;
    uint8_t awbc6;
    uint8_t com16;
} ov7670_white_balance_config_t;
/*! end of White balance configuration structure                              */

/*! @brief Light mode configuration structure                                 */
typedef struct ov7670_light_mode_config
{
    uint8_t com8;
    uint8_t com9;
    uint8_t red;
    uint8_t green;
    uint8_t blue;
} ov7670_light_mode_config_t;
/*! end of Light mode configuration structure                                 */

/*! @brief Color saturation configuration structure                           */
typedef struct ov7670_color_saturation_config
{
    uint8_t mtx1;
    uint8_t mtx2;
    uint8_t mtx3;
    uint8_t mtx4;
    uint8_t mtx5;
    uint8_t mtx6;
    uint8_t mtxs;
    uint8_t com16;
} ov7670_color_saturation_config_t;
/*! end of Color saturation configuration structure                           */

/*! @brief Special effects configuration structure                          */
typedef struct ov7670_special_effect_config
{
    uint8_t tslb;
    uint8_t manu;
    uint8_t manv;
} ov7670_special_effect_config_t;
/*! end of Special effects configuration structure                            */

/*! @brief Windowing configuration structure                                  */
typedef struct ov7670_windowing_config
{
    uint8_t href;
    uint8_t hstart;
    uint8_t hstop;
    uint8_t vref;
    uint8_t vstart;
    uint8_t vstop;
} ov7670_windowing_config_t;

/*! @brief Gamma curve slope configuration structure                          */
typedef struct ov7670_gammaCurveSlopeConfig
{
    uint8_t slope;
    uint8_t gam1;
    uint8_t gam2;
    uint8_t gam3;
    uint8_t gam4;
    uint8_t gam5;
    uint8_t gam6;
    uint8_t gam7;
    uint8_t gam8;
    uint8_t gam9;
    uint8_t gam10;
    uint8_t gam11;
    uint8_t gam12;
    uint8_t gam13;
    uint8_t gam14;
    uint8_t gam15;
} ov7670_gamma_curve_slope_config_t;
/*! end of Gamma curve slope  configuration structure                         */

/*! @brief Advanced initialization structure of ov7670 */
typedef struct ov7670_advanced_config
{
    ov7670_filter_config_t *filter;
    ov7670_night_mode_config_t *nightMode;
    ov7670_white_balance_config_t *whiteBalance;
    ov7670_light_mode_config_t *lightMode;
    ov7670_color_saturation_config_t *colorSaturation;
    ov7670_special_effect_config_t *specialEffect;
    ov7670_gamma_curve_slope_config_t *gammaCurveSlope;
} ov7670_advanced_config_t;

/*! @brief Initialization structure of ov7670 */
typedef struct ov7670_config
{
    ov7670_output_format_config_t *outputFormat;
    uint32_t resolution;
    ov7670_frame_rate_config_t *frameRate;
    uint8_t contrast;
    uint8_t brightness;
    ov7670_advanced_config_t *advancedConfig;
} ov7670_config_t;

