lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.h
/*! @brief ov7670 input clock. */
typedef enum _ov7670_xclock
{
    kOV7670_InputClock24MHZ, /*!< Input clock 24MHZ. */
    kOV7670_InputClock26MHZ, /*!< Input clock 26MHZ. */
    kOV7670_InputClock12MHZ, /*!< Input clock 12MHZ. */
    kOV7670_InputClock13MHZ, /*!< Input clock 13MHZ. */
} ov7670_xclock_t;

/*!
 * @brief OV7670 resource.
 *
 * Before initialize the OV7670, the resource must be initialized that the SCCB
 * I2C could start to work.
 */
typedef struct _ov7670_resource
{
    sccb_i2c_send_func_t i2cSendFunc;       /*!< I2C send function. */
    sccb_i2c_receive_func_t i2cReceiveFunc; /*!< I2C receive function. */
    ov7670_xclock_t xclock;                 /*!< Input clock for ov7670. */
} ov7670_resource_t;

/*! @brief OV7670 operation functions. */
extern const camera_device_operations_t ov7670_ops;

/*! @brief OV7670 resolution options                                          */
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_VGA_DEFAULT;
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_QVGA_DEFAULT;
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_QQVGA_DEFAULT;
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_CIF_DEFAULT;
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_QCIF_DEFAULT;
extern ov7670_window_start_point_t OV7670_WINDOW_START_POINT_QQCIF_DEFAULT;

/*! @brief Night mode initialization structure data                           */
extern ov7670_output_format_config_t OV7670_FORMAT_RawBayerRGB;
extern ov7670_output_format_config_t OV7670_FORMAT_ProcessedBayerRGB;
extern ov7670_output_format_config_t OV7670_FORMAT_YUV422;
extern ov7670_output_format_config_t OV7670_FORMAT_GRB422;
extern ov7670_output_format_config_t OV7670_FORMAT_RGB565;
extern ov7670_output_format_config_t OV7670_FORMAT_RGB555;
extern ov7670_output_format_config_t OV7670_FORMAT_xRGB444;
extern ov7670_output_format_config_t OV7670_FORMAT_RGBx444;

/*! @brief resolution initialization structure data                           */
extern ov7670_resolution_config_t OV7670_RESOLUTION_VGA;
extern ov7670_resolution_config_t OV7670_RESOLUTION_QVGA;
extern ov7670_resolution_config_t OV7670_RESOLUTION_QQVGA;

extern ov7670_resolution_config_t OV7670_RESOLUTION_CIF;
extern ov7670_resolution_config_t OV7670_RESOLUTION_QCIF;
extern ov7670_resolution_config_t OV7670_RESOLUTION_QQCIF;

extern ov7670_resolution_config_t OV7670_RESOLUTION_QVGA_ORIGINAL;
extern ov7670_resolution_config_t OV7670_RESOLUTION_QCIF_ORIGINAL;

/*! @brief Special effects configuration initialization structure data       */
extern ov7670_windowing_config_t OV7670_WINDOW_VGA;
extern ov7670_windowing_config_t OV7670_WINDOW_QVGA;
extern ov7670_windowing_config_t OV7670_WINDOW_QQVGA;
extern ov7670_windowing_config_t OV7670_WINDOW_CIF;
extern ov7670_windowing_config_t OV7670_WINDOW_QCIF;
extern ov7670_windowing_config_t OV7670_WINDOW_QQCIF;

/*! @brief Frame rate initialization structure data                           */
extern ov7670_frame_rate_config_t OV7670_30FPS_26MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_25FPS_26MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_15FPS_26MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_14FPS_26MHZ_XCLK;

extern ov7670_frame_rate_config_t OV7670_30FPS_24MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_25FPS_24MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_15FPS_24MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_14FPS_24MHZ_XCLK;

extern ov7670_frame_rate_config_t OV7670_30FPS_13MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_25FPS_13MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_15FPS_13MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_14FPS_13MHZ_XCLK;

extern ov7670_frame_rate_config_t OV7670_30FPS_12MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_25FPS_12MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_15FPS_12MHZ_XCLK;
extern ov7670_frame_rate_config_t OV7670_14FPS_12MHZ_XCLK;

/*! @brief Night mode initialization structure data                           */
extern ov7670_night_mode_config_t OV7670_NIGHT_MODE_DISABLED;
extern ov7670_night_mode_config_t OV7670_NIGHT_MODE_AUTO_FR_DIVBY2;
extern ov7670_night_mode_config_t OV7670_NIGHT_MODE_AUTO_FR_DIVBY4;
extern ov7670_night_mode_config_t OV7670_NIGHT_MODE_AUTO_FR_DIVBY8;

/*! @brief Banding filter initialization structure data                       */
extern ov7670_filter_config_t OV7670_FILTER_DISABLED;
extern ov7670_filter_config_t OV7670_FILTER_30FPS_60HZ;
extern ov7670_filter_config_t OV7670_FILTER_15FPS_60HZ;
extern ov7670_filter_config_t OV7670_FILTER_25FPS_50HZ;
extern ov7670_filter_config_t OV7670_FILTER_14FPS_50HZ;
extern ov7670_filter_config_t OV7670_FILTER_30FPS_60HZ_AUTO_LIGHT_FREQ_DETECT;
extern ov7670_filter_config_t OV7670_FILTER_15FPS_60HZ_AUTO_LIGHT_FREQ_DETECT;
extern ov7670_filter_config_t OV7670_FILTER_25FPS_50HZ_AUTO_LIGHT_FREQ_DETECT;
extern ov7670_filter_config_t OV7670_FILTER_14FPS_50HZ_AUTO_LIGHT_FREQ_DETECT;

/*! @brief White balance initialization structure data                        */
extern ov7670_white_balance_config_t OV7670_WHITE_BALANCE_DEFAULT;
extern ov7670_white_balance_config_t OV7670_WHITE_BALANCE_DISABLED;
extern ov7670_white_balance_config_t OV7670_WHITE_BALANCE_SIMPLE;

/*! @brief Light mode configuration initialization structure data             */
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_DISABLED;
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_AUTO;
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_SUNNY;
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_CLOUDY;
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_OFFICE;
extern ov7670_light_mode_config_t OV7670_LIGHT_MODE_HOME;

/*! @brief Color saturation configuration initialization structure data       */
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_4PLUS;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_3PLUS;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_2PLUS;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_1PLUS;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_0;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_DEFAULT;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_1MINUS;
extern ov7670_color_saturation_config_t OV7670_COLOR_SATURATION_2MINUS;

/*! @brief Special effects configuration initialization structure data       */
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_ANTIQUE;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_SEPHIA;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BLUISH;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_GREENISH;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_REDISH;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BW;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_NEGATIVE;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_BW_NEGATIVE;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_NORMAL;
extern ov7670_special_effect_config_t OV7670_SPECIAL_EFFECT_DISABLED;

/*! @brief Special effects configuration initialization structure data       */
extern ov7670_gamma_curve_slope_config_t OV7670_GAMMA_CURVE_SLOPE_DEFAULT;
extern ov7670_gamma_curve_slope_config_t OV7670_GAMMA_CURVE_SLOPE1;

