lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Get ov7670 default configuration.
 *
 *  config.outputFormat = (ov7670_output_format_config_t *)&OV7670_FORMAT_RGB565;
 *  config.resolution = kVIDEO_ResolutionQQVGA;
 *  config.frameRate = (ov7670_frame_rate_config_t *)&OV7670_25FPS_12MHZ_XCLK,
 *  config.contrast = 0x30;
 *  config.brightness = 0x10;
 *  config.advancedConfig = NULL;
 * @param config ov7670 configuration structure #ov7670_config_t.
 */
void OV7670_GetDefaultConfig(ov7670_config_t *config);

/*!
 * @brief ov7670 initialize function.
 *
 * This function will initialize ov7670 using the configuration user passed in.
 * Note: If the config pointer is NULL, it would just simply reset ov7670
 * If config is not NULL but the config->advancedConfig is NULL, it will use the below advanced setting:
 *     advancedConfig =
 *     {                                                                                            \
 *         .filter = (ov7670_filter_config_t *)&OV7670_FILTER_25FPS_50HZ,                                 \
 *         .nightMode = (ov7670_night_mode_config_t *)&OV7670_NIGHT_MODE_DISABLED,                     \
 *         .whiteBalance = (ov7670_white_balance_config_t *)&OV7670_WHITE_BALANCE_SIMPLE,              \
 *         .lightMode = (ov7670_light_mode_config_t *)&OV7670_LIGHT_MODE_DISABLED,                     \
 *         .colorSaturation = (ov7670_color_saturation_config_t *)&OV7670_COLOR_SATURATION_2PLUS,      \
 *         .specialEffect = (ov7670_special_effect_config_t *)&OV7670_SPECIAL_EFFECT_DISABLED,         \
 *         .gammaCurveSlope = (ov7670_gamma_curve_slope_config_t *)&OV7670_GAMMA_CURVE_SLOPE_DEFAULT, \
 *     }
 * @param handle Camera device handle.
 * @param config ov7670 configuration structure #ov7670_config_t.
 */

status_t OV7670_CameraInit(camera_device_handle_t *handle, const ov7670_config_t *config);
/*!
 * @brief Write CONTRAST register to ov7670 using I2C.
 * @param handle Camera device handle.
 * @param val contrast value.
 */
status_t OV7670_ContrastAdjustment(camera_device_handle_t *handle, uint8_t val);

/*!
 * @brief Write BRIGHT register to ov7670 using I2C.
 * @param handle Camera device handle.
 * @param val brightness value.
 */
status_t OV7670_BrightnessAdjustment(camera_device_handle_t *handle, uint8_t val);

/*!
 * @brief OV7670 configuration.
 * @param handle Camera device handle.
 * @param config #ov7670_config_t structure.
 */
status_t OV7670_Configure(camera_device_handle_t *handle, const ov7670_config_t *config);

/*!
 * @brief OV7670 Output format configuration.
 * @param handle Camera device handle.
 * @param outputFormatConfig #ov7670_output_format_config_t structure.
 */
status_t OV7670_OutputFormat(camera_device_handle_t *handle, const ov7670_output_format_config_t *outputFormatConfig);

/*!
 * @brief OV7670 Resolution configuration.
 * @param handle Camera device handle.
 * @param resolution #video_resolution_t resolution .
 */
status_t OV7670_Resolution(camera_device_handle_t *handle, uint32_t resolution);

/*!
 * @brief OV7670 frame rate adjustment.
 * @param handle Camera device handle.
 * @param frameRateConfig #ov7670_frame_rate_config_t structure.
 */
status_t OV7670_FrameRateAdjustment(camera_device_handle_t *handle, const ov7670_frame_rate_config_t *frameRateConfig);

/*!
 * @brief OV7670 night mode configuration.
 * @param handle Camera device handle.
 * @param nightModeConfig #ov7670_night_mode_config_t structure.
 */
status_t OV7670_NightMode(camera_device_handle_t *handle, const ov7670_night_mode_config_t *nightModeConfig);

/*!
 * @brief OV7670 Bnading filter selection configuration.
 * @param handle Camera device handle.
 * @param filterConfig #ov7670_filter_config_t structure.
 */
status_t OV7670_BandingFilterSelection(camera_device_handle_t *handle, const ov7670_filter_config_t *filterConfig);

/*!
 * @brief OV7670 White balance configuration.
 * @param handle Camera device handle.
 * @param whiteBalanceConfig #ov7670_white_balance_config_t structure.
 */
status_t OV7670_WhiteBalance(camera_device_handle_t *handle, const ov7670_white_balance_config_t *whiteBalanceConfig);

/*!
 * @brief OV7670 Light mode configuration.
 * @param handle Camera device handle.
 * @param lightModeConfig #ov7670_light_mode_config_t structure.
 */
status_t OV7670_LightMode(camera_device_handle_t *handle, const ov7670_light_mode_config_t *lightModeConfig);

/*!
 * @brief OV7670 Color saturation configuration.
 * @param handle Camera device handle.
 * @param colorSaturationConfig #ov7670_color_saturation_config_t structure.
 */
status_t OV7670_ColorSaturation(camera_device_handle_t *handle,
                                const ov7670_color_saturation_config_t *colorSaturationConfig);

/*!
 * @brief OV7670 Special effects configuration.
 * @param handle Camera device handle.
 * @param specialEffectConfig #ov7670_special_effect_config_t structure.
 */
status_t OV7670_SpecialEffects(camera_device_handle_t *handle,
                               const ov7670_special_effect_config_t *specialEffectConfig);

/*!
 * @brief OV7670 Windowing configuration.
 * @param handle Camera device handle.
 * @param windowingConfig #ov7670_windowing_config_t structure.
 */
status_t OV7670_SetWindow(camera_device_handle_t *handle, const ov7670_windowing_config_t *windowingConfig);

/*!
 * @brief OV7670 Configure the window by setting initial coordinates and
 *               resolution.
 * @param handle Camera device handle.
 * @param startPoint #ov7670_window_start_point_t structure.
 * @param resolution #ovideo_resolution_t resolution.
 */
status_t OV7670_SetWindowByCoordinates(camera_device_handle_t *handle,
                                       ov7670_window_start_point_t *startPoint,
                                       uint32_t resolution);

/*!
 * @brief OV7670 Gamma curve slope configuration.
 * @param handle Camera device handle.
 * @param gammaCurveSlopeConfig #ov7670_gamma_curve_slope_config_t structure.
 */
status_t OV7670_GammaCurveSlope(camera_device_handle_t *handle,
                                const ov7670_gamma_curve_slope_config_t *gammaCurveSlopeConfig);

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_OV7670_H_ */
